deividAlfa/stm32_soldering_iron_controller/TEST/STM32SolderingStation.ioc
#MicroXplorer Configuration settings - do not modify
Mcu.Family=STM32F1
ProjectManager.MainLocation=Core/Src
RCC.MCOFreq_Value=36000000
Dma.ADC1.1.MemDataAlignment=DMA_MDATAALIGN_HALFWORD
NVIC.I2C1_EV_IRQn=true\:3\:0\:true\:false\:true\:true\:true
ProjectManager.KeepUserCode=true
Mcu.UserName=STM32F101RBTx
ADC1.ContinuousConvMode=ENABLE
Dma.I2C1_TX.2.PeriphDataAlignment=DMA_PDATAALIGN_BYTE
SH.ADCx_IN2.0=ADC1_IN2,IN2
VP_TIM4_VS_OPM.Mode=OPM_bit
RCC.PLLCLKFreq_Value=36000000
VP_IWDG_VS_IWDG.Mode=IWDG_Activate
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-MX_DMA_Init-DMA-false-HAL-true,3-SystemClock_Config-RCC-false-HAL-false,4-MX_ADC1_Init-ADC1-false-HAL-true,5-MX_IWDG_Init-IWDG-false-HAL-true,6-MX_TIM3_Init-TIM3-false-HAL-true,7-MX_CRC_Init-CRC-false-HAL-true,8-MX_TIM4_Init-TIM4-false-HAL-true,9-MX_I2C1_Init-I2C1-false-HAL-true
PA9.GPIOParameters=GPIO_Label
PA3.GPIOParameters=PinState,GPIO_Label,GPIO_ModeDefaultOutputPP
RCC.ADCFreqValue=9000000
PA6.GPIO_Label=WAKE
PB0.GPIO_Label=PWM
PB6.GPIO_Label=HW_SCL
Dma.I2C1_TX.2.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority
PA5.PinState=GPIO_PIN_SET
PA2.GPIOParameters=GPIO_Label
PinOutPanel.RotationAngle=0
PB3.GPIO_Speed=GPIO_SPEED_FREQ_HIGH
TIM4.TIM_MasterOutputTrigger=TIM_TRGO_UPDATE
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
ProjectManager.StackSize=0x10
PB5.GPIOParameters=GPIO_Speed,PinState,GPIO_Label
Mcu.IP4=IWDG
Mcu.IP5=NVIC
RCC.FCLKCortexFreq_Value=36000000
Mcu.IP2=DMA
I2C1.IPParameters=I2C_Mode
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.IP3=I2C1
PA15.GPIO_Label=SW_SCL
PB4.GPIOParameters=GPIO_Speed,GPIO_Label
Mcu.IP0=ADC1
Mcu.IP1=CRC
Mcu.UserConstants=
PB3.PinState=GPIO_PIN_SET
Dma.ADC1.1.Instance=DMA1_Channel1
Mcu.ThirdPartyNb=0
RCC.HCLKFreq_Value=36000000
Mcu.IPNb=10
ProjectManager.PreviousToolchain=
RCC.APB2TimFreq_Value=64000000
PB6.Signal=I2C1_SCL
ADC1.Channel-2\#ChannelRegularConversion=ADC_CHANNEL_9
PB5.PinState=GPIO_PIN_SET
Dma.ADC1.1.PeriphDataAlignment=DMA_PDATAALIGN_HALFWORD
PB6.Mode=I2C
SH.ADCx_IN7.ConfNb=1
PA8.GPIOParameters=GPIO_Label
Mcu.Pin6=PA6
Mcu.Pin7=PA7
Mcu.Pin8=PB0
Mcu.Pin9=PB1
RCC.AHBFreq_Value=36000000
Mcu.Pin0=PA0-WKUP
Mcu.Pin1=PA1
GPIO.groupedBy=Group By Peripherals
Mcu.Pin2=PA2
Dma.I2C1_TX.2.MemDataAlignment=DMA_MDATAALIGN_BYTE
Mcu.Pin3=PA3
PA0-WKUP.GPIOParameters=GPIO_Label
Mcu.Pin4=PA4
Mcu.Pin5=PA5
ADC1.Channel-0\#ChannelRegularConversion=ADC_CHANNEL_2
ProjectManager.ProjectBuild=false
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PA8.Locked=true
PA4.Locked=true
NVIC.SysTick_IRQn=true\:0\:0\:false\:false\:true\:false\:true
RCC.PLLMUL=RCC_PLL_MUL9
ProjectManager.FirmwarePackage=STM32Cube FW_F1 V1.8.4
MxDb.Version=DB.6.0.21
PB0.GPIOParameters=GPIO_Label
ADC1.Rank-2\#ChannelRegularConversion=3
PA1.GPIOParameters=GPIO_Label
ProjectManager.BackupPrevious=false
Dma.ADC1.1.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority
PA14.Mode=Serial_Wire
Dma.MEMTOMEM.0.Instance=DMA1_Channel2
TIM3.Prescaler=359
PB1.GPIO_Label=VIN
File.Version=6
PA10.GPIO_Label=ENC_R
Dma.ADC1.1.Priority=DMA_PRIORITY_VERY_HIGH
PB3.GPIOParameters=GPIO_Speed,PinState,GPIO_Label,GPIO_ModeDefaultOutputPP
PB7.Signal=I2C1_SDA
Dma.ADC1.1.Mode=DMA_NORMAL
PA8.Signal=GPIO_Input
PB8.Locked=true
PB6.Locked=true
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PA15.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_OD
NVIC.I2C1_ER_IRQn=true\:3\:0\:true\:false\:true\:true\:true
Dma.RequestsNb=3
PB6.GPIOParameters=GPIO_Label
ProjectManager.HalAssertFull=false
PB0.Locked=true
ADC1.SamplingTime-0\#ChannelRegularConversion=ADC_SAMPLETIME_13CYCLES_5
ProjectManager.ProjectName=STM32SolderingStation
RCC.PLLMCOFreq_Value=18000000
PB7.GPIO_Label=HW_SDA
PB9.Signal=GPIO_Output
Mcu.Package=LQFP64
PB1.Signal=ADCx_IN9
PA6.Signal=GPIO_Input
PA7.Locked=true
PA5.Locked=true
Dma.ADC1.1.Direction=DMA_PERIPH_TO_MEMORY
Dma.MEMTOMEM.0.PeriphInc=DMA_PINC_DISABLE
ProjectManager.ToolChainLocation=
PA2.GPIO_Label=TIP
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
Dma.ADC1.1.MemInc=DMA_MINC_ENABLE
IWDG.Reload=624
PA10.Signal=GPIO_Input
PA15.Signal=GPIO_Output
PA5.GPIOParameters=PinState,GPIO_Label,GPIO_ModeDefaultOutputPP
SH.ADCx_IN9.0=ADC1_IN9,IN9
PA4.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_OD
PB5.GPIO_Speed=GPIO_SPEED_FREQ_HIGH
Dma.I2C1_TX.2.Instance=DMA1_Channel6
PB5.GPIO_Label=OLED_VCC
Dma.Request2=I2C1_TX
Dma.Request1=ADC1
RCC.APB1TimFreq_Value=36000000
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
SH.ADCx_IN9.ConfNb=1
Dma.Request0=MEMTOMEM
PA4.GPIO_Label=BUZ1
ProjectManager.CustomerFirmwarePackage=
VP_TIM3_VS_ClockSourceINT.Mode=Internal
VP_TIM4_VS_OPM.Signal=TIM4_VS_OPM
Dma.I2C1_TX.2.Direction=DMA_MEMORY_TO_PERIPH
PB3.Locked=true
PB4.Signal=GPIO_Output
PA3.Signal=GPIO_Output
PA2.Locked=true
PB3.GPIO_Label=SW_SDA
PA6.GPIOParameters=GPIO_Label
NVIC.DMA1_Channel6_IRQn=true\:4\:0\:true\:false\:true\:false\:true
Dma.MEMTOMEM.0.MemDataAlignment=DMA_MDATAALIGN_WORD
ProjectManager.ProjectFileName=STM32SolderingStation.ioc
TIM4.AutoReloadPreload=TIM_AUTORELOAD_PRELOAD_ENABLE
Dma.I2C1_TX.2.Mode=DMA_NORMAL
PA3.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_OD
PB8.GPIOParameters=GPIO_Label
ADC1.Rank-0\#ChannelRegularConversion=1
PB9.GPIO_Label=OLED  DC
PA15.GPIOParameters=GPIO_Speed,PinState,GPIO_Label,GPIO_ModeDefaultOutputPP
Mcu.PinsNb=29
TIM3.OCFastMode_PWM-PWM\ Generation3\ CH3=TIM_OCFAST_ENABLE
Dma.MEMTOMEM.0.Priority=DMA_PRIORITY_MEDIUM
TIM3.AutoReloadPreload=TIM_AUTORELOAD_PRELOAD_ENABLE
ProjectManager.NoMain=false
ADC1.IPParameters=Rank-0\#ChannelRegularConversion,Channel-0\#ChannelRegularConversion,SamplingTime-0\#ChannelRegularConversion,NbrOfConversionFlag,ExternalTrigConv,Rank-1\#ChannelRegularConversion,Channel-1\#ChannelRegularConversion,SamplingTime-1\#ChannelRegularConversion,Rank-2\#ChannelRegularConversion,Channel-2\#ChannelRegularConversion,SamplingTime-2\#ChannelRegularConversion,NbrOfConversion,ContinuousConvMode,master
PA9.GPIO_Label=ENC_L
ProjectManager.DefaultFWLocation=true
ProjectManager.DeletePrevious=true
SH.S_TIM3_CH3.0=TIM3_CH3,PWM Generation3 CH3
ADC1.SamplingTime-2\#ChannelRegularConversion=ADC_SAMPLETIME_13CYCLES_5
RCC.FamilyName=M
PA0-WKUP.GPIO_Label=EE_SCL
PA0-WKUP.Signal=GPIO_Analog
PA0-WKUP.Locked=true
PB9.GPIOParameters=GPIO_Label
RCC.ADCPresc=RCC_ADCPCLK2_DIV4
PA13.Signal=SYS_JTMS-SWDIO
TIM3.Channel-PWM\ Generation3\ CH3=TIM_CHANNEL_3
PB8.GPIO_Label=OLED RST
PA15.Locked=true
PA8.GPIO_Label=ENC_SW
PA4.PinState=GPIO_PIN_SET
VP_TIM4_VS_ClockSourceINT.Signal=TIM4_VS_ClockSourceINT
ProjectManager.TargetToolchain=STM32CubeIDE
TIM4.IPParameters=Prescaler,TIM_MasterOutputTrigger,AutoReloadPreload
SH.S_TIM3_CH3.ConfNb=1
SH.ADCx_IN7.0=ADC1_IN7,IN7
I2C1.I2C_Mode=I2C_Fast
VP_CRC_VS_CRC.Signal=CRC_VS_CRC
Dma.I2C1_TX.2.Priority=DMA_PRIORITY_LOW
PB7.GPIOParameters=GPIO_Label
PA9.Signal=GPIO_Input
ADC1.Channel-1\#ChannelRegularConversion=ADC_CHANNEL_7
PB9.Locked=true
ProjectManager.RegisterCallBack=
RCC.USBFreq_Value=64000000
VP_TIM3_VS_ClockSourceINT.Signal=TIM3_VS_ClockSourceINT
TIM4.Prescaler=359
PA1.Signal=GPIO_Analog
PB1.Locked=true
PA5.Signal=GPIO_Output
board=custom
ProjectManager.LastFirmware=true
NVIC.TIM3_IRQn=true\:2\:0\:true\:false\:true\:true\:true
RCC.VCOOutput2Freq_Value=4000000
PA15.PinState=GPIO_PIN_SET
PB4.GPIO_Speed=GPIO_SPEED_FREQ_HIGH
RCC.APB2Freq_Value=36000000
MxCube.Version=6.2.1
PB4.GPIO_Label=OLED_GND
PA5.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_OD
Dma.I2C1_TX.2.MemInc=DMA_MINC_ENABLE
SH.ADCx_IN2.ConfNb=1
PA1.GPIO_Label=EE_SDA
PA10.GPIOParameters=GPIO_Label
VP_SYS_VS_Systick.Mode=SysTick
TIM3.IPParameters=Prescaler,TIM_MasterOutputTrigger,Channel-PWM Generation3 CH3,AutoReloadPreload,OCFastMode_PWM-PWM Generation3 CH3
PA9.Locked=true
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PA4.GPIOParameters=PinState,GPIO_Label,GPIO_ModeDefaultOutputPP
Dma.ADC1.1.PeriphInc=DMA_PINC_DISABLE
ADC1.NbrOfConversion=3
PA13.Mode=Serial_Wire
ProjectManager.FreePins=false
RCC.IPParameters=ADCFreqValue,ADCPresc,AHBFreq_Value,APB1Freq_Value,APB1TimFreq_Value,APB2Freq_Value,APB2TimFreq_Value,FCLKCortexFreq_Value,FamilyName,HCLKFreq_Value,MCOFreq_Value,PLLCLKFreq_Value,PLLMCOFreq_Value,PLLMUL,SYSCLKFreq_VALUE,SYSCLKSource,TimSysFreq_Value,USBFreq_Value,VCOOutput2Freq_Value
IWDG.IPParameters=Prescaler,Reload
ProjectManager.AskForMigrate=true
Mcu.Name=STM32F101R(8-B)Tx
Mcu.Pin26=VP_TIM3_VS_ClockSourceINT
Mcu.Pin27=VP_TIM4_VS_ClockSourceINT
PA2.Signal=ADCx_IN2
Mcu.Pin24=VP_IWDG_VS_IWDG
ProjectManager.UnderRoot=true
Mcu.Pin25=VP_SYS_VS_Systick
Mcu.IP8=TIM3
ADC1.ExternalTrigConv=ADC_SOFTWARE_START
Mcu.IP9=TIM4
Mcu.Pin28=VP_TIM4_VS_OPM
Dma.MEMTOMEM.0.PeriphDataAlignment=DMA_PDATAALIGN_WORD
Mcu.IP6=RCC
Mcu.IP7=SYS
ProjectManager.CoupleFile=false
PB4.Locked=true
PB3.Signal=GPIO_Output
PA4.Signal=GPIO_Output
ADC1.SamplingTime-1\#ChannelRegularConversion=ADC_SAMPLETIME_13CYCLES_5
RCC.SYSCLKFreq_VALUE=36000000
PB5.Signal=GPIO_Output
Mcu.Pin22=PB9
Mcu.Pin23=VP_CRC_VS_CRC
RCC.TimSysFreq_Value=36000000
PA1.Locked=true
PA7.GPIO_Label=NTC
Mcu.Pin20=PB7
ADC1.master=1
PA3.Locked=true
Mcu.Pin21=PB8
PA5.GPIO_Label=BUZ2
PA10.Locked=true
Dma.MEMTOMEM.0.Mode=DMA_NORMAL
NVIC.ForceEnableDMAVector=true
KeepUserPlacement=false
Dma.MEMTOMEM.0.MemInc=DMA_MINC_ENABLE
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false
ProjectManager.CompilerOptimize=6
PA15.GPIO_Speed=GPIO_SPEED_FREQ_HIGH
ADC1.Rank-1\#ChannelRegularConversion=2
PB7.Mode=I2C
VP_IWDG_VS_IWDG.Signal=IWDG_VS_IWDG
PA14.Signal=SYS_JTCK-SWCLK
Dma.I2C1_TX.2.PeriphInc=DMA_PINC_DISABLE
ProjectManager.HeapSize=0x10
Mcu.Pin15=PA15
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.Pin16=PB3
Mcu.Pin13=PA13
Mcu.Pin14=PA14
Mcu.Pin19=PB6
ProjectManager.ComputerToolchain=false
Mcu.Pin17=PB4
Mcu.Pin18=PB5
VP_TIM4_VS_ClockSourceINT.Mode=Internal
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
ADC1.NbrOfConversionFlag=1
Mcu.Pin11=PA9
Mcu.Pin12=PA10
Mcu.Pin10=PA8
IWDG.Prescaler=IWDG_PRESCALER_32
PB7.Locked=true
PB8.Signal=GPIO_Output
Dma.MEMTOMEM.0.Direction=DMA_MEMORY_TO_MEMORY
PA3.PinState=GPIO_PIN_SET
Dma.MEMTOMEM.0.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority
NVIC.DMA1_Channel1_IRQn=true\:1\:0\:true\:false\:true\:false\:true
TIM3.TIM_MasterOutputTrigger=TIM_TRGO_UPDATE
NVIC.TIM4_IRQn=true\:2\:0\:true\:false\:true\:true\:true
RCC.APB1Freq_Value=36000000
VP_CRC_VS_CRC.Mode=CRC_Activate
PB0.Signal=S_TIM3_CH3
PA7.GPIOParameters=GPIO_Label
ProjectManager.DeviceId=STM32F101RBTx
ProjectManager.LibraryCopy=1
PB3.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_OD
PA3.GPIO_Label=BUZ0
PB1.GPIOParameters=GPIO_Label
PA7.Signal=ADCx_IN7
PA6.Locked=true
isbadioc=false
